<template>
  <div style="padding-top: 100px">
    <b-card v-for="content in listsContent"
            :key="content"
            :id="content"
            :title="translateTitle(content)">
      <b-card-text>
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
        Здесь будет что то описано по каждому из типов, текст тестовый
      </b-card-text>
    </b-card>
  </div>
</template>

<script>
export default {
  name: "Main",
  data: () => ({
    listsContent: ['clients', 'contacts', 'fromMe']
  }),
  methods: {
    translateTitle(title) {
      switch (title) {
        case 'clients':
          return 'Наши клиенты';
        case 'contacts':
          return 'Контакты';
        case 'fromMe':
          return 'О нас';
        default:
          return ''
      }
    }
  }
}
</script>

<style scoped>
</style>